format long g %显示更多小数位

%目标函数
c = zeros(9,1); %初始化9个决策变量
c(1) = 1.25 -0.25 -300/6000*5;  % x1前面的系数
c(2) = 1.25 -0.25 -321/10000*7;
c(3) = -250 / 4000 * 6;
c(4)  = -783/7000*4;
c(5) = -200/4000 * 7;
c(6) = -300/6000*10;
c(7) = -321 / 10000 * 9;
c(8) = 2-0.35-250/4000*8;
c(9) = 2.8-0.5-321/10000*12-783/7000*11;
c=-c; %先转换成求最小值

% 不等式约束
A = zeros(5,9); %5个不等式约束条件
A(1,1) = 5;  A(1,6) = 10;
A(2,2) = 7;  A(2,7) = 9; A(2,9) = 12;
A(3,3) = 6;  A(3,8) = 8;
A(4,4) = 4;  A(4,9) = 11;
A(5,5) = 7;  %第5个不等式左边x5的系数
b = [6000 10000 4000 7000 4000]'; %不等式右边的值

% 等式约束
Aeq = [1 1 -1 -1 -1 0 0 0 0;
       0 0 0 0 0 1 1 -1 0]; %等式左边的系数
beq = [0 0]'; %等式右边的值

lb = zeros(9,1); %下界
[x,fval] = linprog(c,A,b,Aeq,beq,lb);
fval = -fval;
disp('求出的x值为：')
disp(x);
disp(['最大值为：',num2str(fval)])